-- phpMyAdmin SQL Dump
-- version 5.2.1deb1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Nov 21, 2024 at 04:21 PM
-- Server version: 10.11.6-MariaDB-0+deb12u1
-- PHP Version: 8.2.24

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `isrs`
--

-- --------------------------------------------------------

--
-- Table structure for table `colors`
--

CREATE TABLE `colors` (
  `color_id` int(2) NOT NULL,
  `color_name` varchar(128) NOT NULL,
  `color_color` varchar(32) NOT NULL,
  `color_president` varchar(32) NOT NULL,
  `color_vice-president` varchar(32) NOT NULL,
  `color_id_user` int(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `colors`
--

INSERT INTO `colors` (`color_id`, `color_name`, `color_color`, `color_president`, `color_vice-president`, `color_id_user`) VALUES
(0, 'Ash the Test_user1', 'สีเทา', 'นายวัธนชัย ไม้จำปา', 'นางสาวกุลจิรา นามใจ', 2),
(1, 'RedRumble', 'สีแดง', 'นายประธาน สีแดง', 'นายพระรอง ประธานสีแดง', 4),
(2, 'OceanShadow', 'สีฟ้า', 'นายประธาน สีฟ้า', 'นายพระรอง ประธานสีฟ้า', 5),
(3, 'GreenGuardian', 'สีเขียว', 'นายประธาน สีเขียว', 'นายพระรอง ประธานสีเขียว', 6),
(4, 'GoldenLion', 'สีเหลือง', 'นายประธาน สีเหลือง', 'นายพระรอง ประธานสีเหลือง', 7),
(5, 'PinkStorm', 'สีชมพู', 'นายประธาน สีชมพู', 'นายพระรอง ประธานสีชมพู', 8);

-- --------------------------------------------------------

--
-- Table structure for table `players`
--

CREATE TABLE `players` (
  `id_player` int(5) NOT NULL,
  `player_id` int(5) NOT NULL,
  `player_title` varchar(16) NOT NULL,
  `player_name` varchar(64) NOT NULL,
  `player_sirname` varchar(64) NOT NULL,
  `player_class` int(2) NOT NULL,
  `player_room` int(2) NOT NULL,
  `player_color_id` int(2) NOT NULL,
  `player_sport_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `reward`
--

CREATE TABLE `reward` (
  `reward_id` int(6) NOT NULL,
  `reward_sport_id` int(11) NOT NULL,
  `reward_first` int(2) NOT NULL,
  `reward_second` int(2) NOT NULL,
  `reward_third` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `sports`
--

CREATE TABLE `sports` (
  `sport_id` int(11) NOT NULL,
  `sport_name` varchar(128) NOT NULL,
  `sport_type` varchar(64) NOT NULL,
  `sport_degree` varchar(16) NOT NULL,
  `sport_gender` varchar(8) NOT NULL,
  `sport_amount` int(2) NOT NULL,
  `sport_note` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `sports`
--

INSERT INTO `sports` (`sport_id`, `sport_name`, `sport_type`, `sport_degree`, `sport_gender`, `sport_amount`, `sport_note`) VALUES
(1, 'ฟุตบอล มัธยมต้น ชาย', 'ฟุตบอล', 'มัธยมต้น', 'ชาย', 11, ''),
(2, 'ฟุตบอล มัธยมปลาย ชาย', 'ฟุตบอล', 'มัธยมปลาย', 'ชาย', 11, ''),
(4, 'ฟุตบอล ทีมหญิงรวม', 'ฟุตบอล', 'ผสม', 'หญิง', 11, ''),
(5, 'ฟุตซอล มัธยมต้น ชาย', 'ฟุตซอล', 'มัธยมต้น', 'ชาย', 12, ''),
(7, 'ฟุตซอล มัธยมปลาย ชาย', 'ฟุตซอล', 'มัธยมปลาย', 'ชาย', 12, ''),
(8, 'ฟุตซอล ทีมหญิงรวม', 'ฟุตซอล', 'ผสม', 'หญิง', 12, ''),
(11, 'แฮนด์บอล ประเภททีมชาย', 'แฮนด์บอล', 'อื่นๆ', 'ชาย', 16, 'ระดับชั้นมัธยมศึกษาปีที่ 4'),
(12, 'แฮนด์บอล ประเภททีมหญิง', 'แฮนด์บอล', 'อื่นๆ', 'หญิง', 16, 'ระดับชั้นมัธยมศึกษาปีที่ 4'),
(13, 'วอลเลย์บอล มัธยมต้น ชาย', 'วอลเลย์บอล', 'มัธยมต้น', 'ชาย', 12, ''),
(14, 'วอลเลย์บอล มัธยมต้น หญิง', 'วอลเลย์บอล', 'มัธยมต้น', 'หญิง', 12, ''),
(15, 'วอลเลย์บอล มัธยมปลาย ชาย', 'วอลเลย์บอล', 'มัธยมปลาย', 'ชาย', 12, ''),
(16, 'วอลเลย์บอล มัธยมปลาย หญิง', 'วอลเลย์บอล', 'มัธยมปลาย', 'หญิง', 12, ''),
(17, 'เปตอง เดี่ยว มัธยมต้น ชาย', 'เปตอง', 'มัธยมต้น', 'ชาย', 1, 'ประเภท เดี่ยว'),
(18, 'เปตอง เดี่ยว มัธยมต้น หญิง', 'เปตอง', 'มัธยมต้น', 'หญิง', 1, 'ประเภท เดี่ยว'),
(19, 'เปตอง เดี่ยว มัธยมปลาย ชาย', 'เปตอง', 'มัธยมปลาย', 'ชาย', 1, 'ประเภท เดี่ยว'),
(20, 'เปตอง เดี่ยว มัธยมปลาย หญิง', 'เปตอง', 'มัธยมปลาย', 'หญิง', 1, 'ประเภท เดี่ยว'),
(22, 'เปตอง คู่ผสม มัธยมต้น', 'เปตอง', 'มัธยมต้น', 'ผสม', 2, 'ประเภท คู่ผสม'),
(23, 'เปตอง คู่ผสม มัธยมปลาย', 'เปตอง', 'มัธยมปลาย', 'ผสม', 2, 'ประเภท คู่ผสม'),
(26, 'เปตอง ทีมสาม มัธยมต้น หญิง', 'เปตอง', 'มัธยมต้น', 'ผสม', 3, 'ประเภท ทีมสาม'),
(27, 'เปตอง ทีมสาม มัธยมปลาย ชาย', 'เปตอง', 'มัธยมปลาย', 'ผสม', 3, 'ประเภท ทีมสาม'),
(29, 'บาสเกตบอล มัธยมต้น ชาย', 'บาสเกตบอล', 'มัธยมต้น', 'ชาย', 12, ''),
(30, 'บาสเกตบอล มัธยมต้น หญิง', 'บาสเกตบอล', 'มัธยมต้น', 'หญิง', 12, ''),
(31, 'บาสเกตบอล มัธยมปลาย ชาย', 'บาสเกตบอล', 'มัธยมปลาย', 'ชาย', 12, ''),
(32, 'บาสเกตบอล มัธยมปลาย หญิง', 'บาสเกตบอล', 'มัธยมปลาย', 'หญิง', 12, ''),
(33, 'แบดมินตัน ประเภทชายเดี่ยว ม.1-2', 'แบดมินตัน', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 1-2'),
(34, 'แบดมินตัน ประเภทหญิงเดี่ยว ม.1-2', 'แบดมินตัน', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 1-2'),
(35, 'แบดมินตัน ประเภทชายคู่ ม.1-2', 'แบดมินตัน', 'อื่นๆ', 'ชาย', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 1-2'),
(36, 'แบดมินตัน ประเภทหญิงคู่ ม.1-2', 'แบดมินตัน', 'อื่นๆ', 'หญิง', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 1-2'),
(37, 'แบดมินตัน ประเภทคู่ผสม ม.1-2', 'แบดมินตัน', 'อื่นๆ', 'ผสม', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 1-2'),
(38, 'แบดมินตัน ประเภทชายเดี่ยว ม.3-4', 'แบดมินตัน', 'อื่นๆ', 'ชาย', 1, ' ระดับชั้นมัธยมศึกษาปีที่ 3-4'),
(39, 'แบดมินตัน ประเภทหญิงเดี่ยว ม.3-4', 'แบดมินตัน', 'อื่นๆ', 'หญิง', 1, ' ระดับชั้นมัธยมศึกษาปีที่ 3-4'),
(40, 'แบดมินตัน ประเภทชายคู่ ม.3-4', 'แบดมินตัน', 'อื่นๆ', 'ชาย', 2, ' ระดับชั้นมัธยมศึกษาปีที่ 3-4'),
(41, 'แบดมินตัน ประเภทหญิงคู่ ม.3-4', 'แบดมินตัน', 'อื่นๆ', 'หญิง', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 3-4'),
(42, 'แบดมินตัน ประเภทคู่ผสม ม. 3-4', 'แบดมินตัน', 'อื่นๆ', 'ผสม', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 3-4'),
(43, 'แบดมินตัน ประเภทชายเดี่ยว ม.5-6', 'แบดมินตัน', 'อื่นๆ', 'ชาย', 1, ' ระดับชั้นมัธยมศึกษาปีที่ 5-6'),
(44, 'แบดมินตัน ประเภทหญิงเดี่ยว ม.5-6', 'แบดมินตัน', 'อื่นๆ', 'หญิง', 1, ' ระดับชั้นมัธยมศึกษาปีที่ 5-6'),
(45, 'แบดมินตัน ประเภทชายคู่ ม.5-6', 'แบดมินตัน', 'อื่นๆ', 'ชาย', 2, ' ระดับชั้นมัธยมศึกษาปีที่ 5-6'),
(46, 'แบดมินตัน ประเภทหญิงคู่ ม.5-6', 'แบดมินตัน', 'อื่นๆ', 'หญิง', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 5-6'),
(47, 'แบดมินตัน ประเภทคู่ผสม ม. 5-6', 'แบดมินตัน', 'อื่นๆ', 'ผสม', 2, 'ระดับชั้นมัธยมศึกษาปีที่ 5-6'),
(48, 'เทเบิลเทนนิส ม.1 ชายเดี่ยว', 'เทเบิลเทนนิส', 'อื่นๆ', 'ชาย', 1, 'ม.1 ชายเดี่ยว'),
(49, 'เทเบิลเทนนิส ม.1 หญิงเดี่ยว', 'เทเบิลเทนนิส', 'อื่นๆ', 'หญิง', 1, 'ม.1 หญิงเดี่ยว'),
(50, 'เทเบิลเทนนิส ม.1 ชายคู่', 'เทเบิลเทนนิส', 'อื่นๆ', 'ชาย', 2, 'ม.1 ชายคู่'),
(51, 'เทเบิลเทนนิส ม.1 หญิงคู่', 'เทเบิลเทนนิส', 'อื่นๆ', 'หญิง', 2, 'ม.1 หญิงคู่'),
(52, 'เทเบิลเทนนิส ม.1 คู่ผสม', 'เทเบิลเทนนิส', 'อื่นๆ', 'ผสม', 2, 'ม.1 คู่ผสม'),
(53, 'เทเบิลเทนนิส ม.2-3 ชายเดี่ยว', 'เทเบิลเทนนิส', 'อื่นๆ', 'ชาย', 1, 'ม.2-3 ชายเดี่ยว'),
(54, 'เทเบิลเทนนิส ม.2-3 หญิงเดี่ยว', 'เทเบิลเทนนิส', 'อื่นๆ', 'หญิง', 1, 'ม.2-3 หญิงเดี่ยว'),
(55, 'เทเบิลเทนนิส ม.2-3 ชายคู่', 'เทเบิลเทนนิส', 'อื่นๆ', 'ชาย', 2, 'ม.2-3 ชายคู่'),
(56, 'เทเบิลเทนนิส ม.2-3 หญิงคู่', 'เทเบิลเทนนิส', 'อื่นๆ', 'หญิง', 2, 'ม.2-3 หญิงคู่'),
(57, 'เทเบิลเทนนิส ม.2-3 คู่ผสม', 'เทเบิลเทนนิส', 'อื่นๆ', 'ผสม', 2, 'ม.2-3 คู่ผสม'),
(58, 'เทเบิลเทนนิส ม.ปลาย ชายเดี่ยว', 'เทเบิลเทนนิส', 'มัธยมปลาย', 'ชาย', 1, 'ม.ปลาย ชายเดี่ยว'),
(59, 'เทเบิลเทนนิส ม.ปลาย หญิงเดี่ยว', 'เทเบิลเทนนิส', 'มัธยมปลาย', 'หญิง', 1, 'ม.ปลาย หญิงเดี่ยว'),
(60, 'เทเบิลเทนนิส ม.ปลาย ชายคู่', 'เทเบิลเทนนิส', 'มัธยมปลาย', 'ชาย', 2, 'ม.ปลาย ชายคู่'),
(61, 'เทเบิลเทนนิส ม.ปลาย หญิงคู่', 'เทเบิลเทนนิส', 'มัธยมปลาย', 'หญิง', 2, 'ม.ปลาย หญิงคู่'),
(62, 'เทเบิลเทนนิส ม.ปลาย คู่ผสม', 'เทเบิลเทนนิส', 'มัธยมปลาย', 'ผสม', 2, 'ม.ปลาย คู่ผสม'),
(63, '100 เมตร ม.1 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 1 '),
(64, '100 เมตร ม.1 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 1 '),
(65, '100 เมตร ม.2 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 2 '),
(66, '100 เมตร ม.2 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 2 '),
(67, '100 เมตร ม.3 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 3 '),
(68, '100 เมตร ม.3 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 3 '),
(69, '100 เมตร ม.4 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 4 '),
(70, '100 เมตร ม.4 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 4 '),
(71, '100 เมตร ม.5 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 5 '),
(72, '100 เมตร ม.5 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 5 '),
(73, '100 เมตร ม.6 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 6 '),
(74, '100 เมตร ม.6 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 1, 'ระดับชั้นมัธยมศึกษาปีที่ 6 '),
(75, 'วิ่งผลัด 4x100  ม.1 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 1 '),
(76, 'วิ่งผลัด 4x100  ม.1 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 1 '),
(77, 'วิ่งผลัด 4x100  ม.2 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 2 '),
(78, 'วิ่งผลัด 4x100  ม.2 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 2 '),
(79, 'วิ่งผลัด 4x100  ม.3 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 3 '),
(80, 'วิ่งผลัด 4x100  ม.3 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 3 '),
(81, 'วิ่งผลัด 4x100  ม.4 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 4 '),
(82, 'วิ่งผลัด 4x100  ม.4 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 4 '),
(83, 'วิ่งผลัด 4x100  ม.5 ชาย', 'กรีฑา', 'อื่นๆ', 'ชาย', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 5 '),
(84, 'วิ่งผลัด 4x100  ม.5 หญิง', 'กรีฑา', 'อื่นๆ', 'หญิง', 4, 'ระดับชั้นมัธยมศึกษาปีที่ 5 '),
(85, '200 เมตร มัธยมต้น ชาย', 'กรีฑา', 'มัธยมต้น', 'ชาย', 1, ''),
(86, '200 เมตร มัธยมต้น หญิง', 'กรีฑา', 'มัธยมต้น', 'หญิง', 1, ''),
(87, '400 เมตร มัธยมปลาย ชาย', 'กรีฑา', 'มัธยมปลาย', 'ชาย', 1, ''),
(88, '400 เมตร มัธยมปลาย หญิง', 'กรีฑา', 'มัธยมปลาย', 'หญิง', 1, ''),
(89, 'ม.6 ชักเย่อ ทีมชาย', 'กีฬาพื้นบ้าน', 'อื่นๆ', 'ชาย', 15, 'ระดับชั้นมัธยมศึกษาปีที่ 6'),
(90, 'ม.6 ชักเย่อ ทีมหญิง', 'กีฬาพื้นบ้าน', 'อื่นๆ', 'หญิง', 15, 'ระดับชั้นมัธยมศึกษาปีที่ 6'),
(91, 'ม.1 บอลมหาชัย (บอลหลบ)', 'กีฬาแต่ละระดับชั้น', 'อื่นๆ', 'ผสม', 12, 'ชั้นมัธยมศึกษาปีที่ 1 ชาย 6 คน หญิง 6 คน'),
(92, 'ม.2 แอโรบิก', 'กีฬาแต่ละระดับชั้น', 'อื่นๆ', 'ผสม', 35, 'นชั้นมัธยมศึกษาปีที่ 2'),
(93, 'ม.3 Boxing Kids', 'กีฬาแต่ละระดับชั้น', 'อื่นๆ', 'ผสม', 40, 'ชั้นมัธยมศึกษาปีที่ 3'),
(94, 'ม.4 การแข่งขันวงล้อสามัคค', 'กีฬาแต่ละระดับชั้น', 'อื่นๆ', 'ผสม', 12, 'ชั้นมัธยมศึกษาปีที่ 4 ชาย 6 คน หญิง 6 คน');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `user_id` int(3) NOT NULL,
  `user_name` varchar(64) NOT NULL,
  `user_username` varchar(32) NOT NULL,
  `user_password` varchar(64) NOT NULL,
  `user_role` varchar(16) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`user_id`, `user_name`, `user_username`, `user_password`, `user_role`) VALUES
(0, 'Test_user_00', 'root', '12345678', 'admin_system'),
(1, 'Test_user_01', 'a', 'a', 'admin_system'),
(2, 'Test_user_02', 'b', 'b', 'admin_sport'),
(3, 'Test_user_03', 'c', 'c', 'admin_report'),
(4, 'RedHot', 'Red', 'Blaze999', 'admin_sport'),
(5, 'Wave', 'Aqua', 'WaveSea999', 'admin_sport'),
(6, 'Greentea', 'GreenGo', 'Greentea888', 'admin_sport'),
(7, 'Goldie', 'Sun', 'SunShine11', 'admin_sport'),
(8, 'MistyRoyal', 'Misty', 'PinkGlow44', 'admin_sport');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `colors`
--
ALTER TABLE `colors`
  ADD PRIMARY KEY (`color_id`);

--
-- Indexes for table `players`
--
ALTER TABLE `players`
  ADD PRIMARY KEY (`id_player`);

--
-- Indexes for table `reward`
--
ALTER TABLE `reward`
  ADD PRIMARY KEY (`reward_id`);

--
-- Indexes for table `sports`
--
ALTER TABLE `sports`
  ADD PRIMARY KEY (`sport_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `colors`
--
ALTER TABLE `colors`
  MODIFY `color_id` int(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `players`
--
ALTER TABLE `players`
  MODIFY `id_player` int(5) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `reward`
--
ALTER TABLE `reward`
  MODIFY `reward_id` int(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `sports`
--
ALTER TABLE `sports`
  MODIFY `sport_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `user_id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
